-- Перевіряємо успішні та скасовані транзакції з найбільшою кількістю товару. Бачимо, що два успішно сплачених замовлення (TransactionNo = 581483 та 541431) одразу після цього були створені ще раз та відмінені (581483/C581484 та 541431/C541433, відмінені айдішки більш пізні). Можливо, був збій у системі, але потрібно звернутися до представників магазину для уточнення

SELECT *
FROM (
  SELECT *
  FROM sales_clean
  ORDER BY Quantity DESC
  LIMIT 3
)
UNION ALL
SELECT *
FROM (
  SELECT *
  FROM sales_clean
  ORDER BY Quantity
  LIMIT 3
);


-- Подивимось всі замовлення цих клієнтів. Бачимо, що у клієнта 16446 було єдине сплачене замовлення, у клієнта 12346 — два. Тобто після цих великих замовлень, які супроводжувались скасованими дублями, клієнти більше не повертались. Ситуація варта уваги, потрібно звернутися до представників магазину для обговорення. Можливо, було зроблено щось, що призвело до втрати великих гуртових клієнтів.

SELECT *
FROM sales_clean
WHERE CustomerNo = '16446' OR CustomerNo = '12346'
ORDER BY CustomerNo, TransactionNo;
